# What is Database?
A database is an organized collection of data, stored and retrieved digitally from a
remote or local computer system.

Databases can be vast and complex, and such
databases are developed using fixed design and modeling approaches.

---------------------------------------------------------------------------------------------------------

#   What is DBMS?
DBMS stands for Database Management System. DBMS is a system software responsible for the creation, retrieval, updation, and management of the database.

It
ensures that our data is consistent, organized, and is easily accessible by serving as
an interface between the database and its end-users or application software.

---------------------------------------------------------------------------------------------------------

#  What is RDBMS? How is it different from DBMS?
RDBMS stands for Relational Database Management System. 

The key difference here,
compared to DBMS, is that RDBMS stores data in the form of a collection of tables,
and relations can be defined between the common fields of these tables.

Most
modern database management systems like MySQL, Microsoft SQL Server, Oracle,
IBM DB2, and Amazon Redshift based on RDBMS.

---------------------------------------------------------------------------------------------------------

# What is SQL?
SQL stands for Structured Query Language. It is the standard language for relational
database management systems. 

It is especially useful in handling organized data
comprised of entities (variables) and relations between different entities of the data.



#  What are Tables and Fields?
A table is an organized collection of data stored in the form of rows and columns.

Columns can be categorized as vertical and rows as horizontal. The columns in a
table are called fields while the rows can be referred to as records.

```````````````````````````````````````````````````````````````````````````````````````````````````````````````````

# Importance of MYSQL in Data science


-  Data Storage and Management:

MySQL provides a robust platform for storing and managing structured data. In data science, where large volumes of data are generated and analyzed, having a reliable database management system is essential for organizing and accessing data efficiently.

-  Data Acquisition:

MySQL can serve as a central repository for various types of data, including structured, semi-structured, and even unstructured data. Data scientists often need to access and integrate data from multiple sources, and MySQL facilitates this process by allowing seamless data ingestion.

-  Data Exploration and Analysis: 

MySQL supports SQL (Structured Query Language), which is a powerful language for querying and analyzing data. Data scientists can leverage SQL queries to explore datasets, perform aggregations, filter data, and derive meaningful insights directly from the database.

-  Integration with Data Science Tools:

Many data science tools and libraries, such as Python's pandas and R's dplyr, provide connectors and interfaces to interact with MySQL databases. This enables data scientists to seamlessly integrate MySQL into their data analysis workflows and leverage the full capabilities of both SQL and their preferred data science tools.

-  Scalability and Performance: 


MySQL is designed to handle large-scale datasets and high-volume transactional workloads. With proper optimization and configuration, MySQL can offer excellent performance for data retrieval and processing tasks, making it suitable for data-intensive applications in data science.

-  Data Warehousing:

MySQL can be used as part of a data warehousing solution, where historical and aggregated data are stored for analysis and reporting purposes. Data scientists can build data marts or data warehouses on top of MySQL to facilitate complex analytics and decision-making processes.



-  Security and Reliability:

MySQL provides features for data security, access control, and data integrity, ensuring that sensitive information is protected and that data remains consistent and reliable. This is particularly important in data science projects where data privacy and compliance are critical considerations.

# What are Constraints in SQL?
Constraints are used to specify the rules concerning data in the table. 

It can be
applied for single or multiple fields in an SQL table during the creation of the table or after creating using the ALTER TABLE command. 

The constraints are:


NOT NULL - Restricts NULL value from being inserted into a column


CHECK - Verifies that all values in a field satisfy a condition.


DEFAULT - Automatically assigns a default value if no value has been specified
for the field.


UNIQUE - Ensures unique values to be inserted into the field.


INDEX - Indexes a field providing faster retrieval of records.


PRIMARY KEY - Uniquely identifies each record in a table.


FOREIGN KEY - Ensures referential integrity for a record in another table.


#  cursor

 A cursor allows you to execute SQL queries, fetch data from the result sets, and perform various operations on the database.

# Data Types in SQL

Numeric: Whole numbers (e.g., INT) and decimals (FLOAT).

Character: Text (e.g., VARCHAR for variable-length).

Date and Time: Dates (DATE) and timestamps (DATETIME).

# Basic components

DDL (Data Definition Language): Defines database structure (e.g., CREATE TABLE).

DML (Data Manipulation Language): Works with data (e.g., INSERT, UPDATE).

DQL (Data Query Language): Queries data (SELECT).

DCL (Data Control Language): Controls access (GRANT, REVOKE).

TCL (Transaction Control Language): Manages changes (COMMIT, ROLLBACK).

In [2]:
# import library
import sqlite3

In [6]:
# connect a database
db=sqlite3.connect("student3.db")

In [7]:
cursor=db.cursor()    # cursor

In [8]:
cursor.execute("CREATE TABLE student_data1(roll_no INT PRIMARY KEY, name TEXT, total_marks INT, rank INT)")

In [9]:
# insert data in table 
cursor.execute("INSERT INTO student_data1(roll_no,name,total_marks,rank) values(21, 'rohit',400,15),(2,'ajay',350,20),(3,'aakash',420,12),(4,'akash',410,13),(5,'sahil',440,8),(6,'vipul',340,21),(7,'nikhil',400,15),(8,'abhishek',450,7),(9,'ekta',408,14),(10,'sachin',460,5),(11,'simran',330,22),(12,'nancy',400,15),(13,'ayushi',330,22),(14,'mohit',480,2),(15,'rahul',485,1),(16,'deepika',250,27),(17,'deepak',290,24),(18,'mohit',395,16),(19,'abhisheek',288,24),(20,'navdeep',435,9)")

In [10]:
#save data
db.commit()

In [11]:
cursor.rowcount,"rows inserted"

(20, 'rows inserted')

In [8]:
import pandas as pd

# Step 2: Write the SQL query as a string
query = "SELECT * FROM student_dataa;"  # Replace with your table name

# Step 3: Use pandas to execute the query
data = pd.read_sql_query(query, db)

# Step 4: Display the data
display(data)

    roll_no       name  total_marks  rank
0        21      rohit          400    15
1         2       ajay          350    20
2         3     aakash          420    12
3         4      akash          410    13
4         5      sahil          440     8
5         6      vipul          340    21
6         7     nikhil          400    15
7         8   abhishek          450     7
8         9       ekta          408    14
9        10     sachin          460     5
10       11     simran          330    22
11       12      nancy          400    15
12       13     ayushi          330    22
13       14      mohit          480     2
14       15      rahul          485     1
15       16    deepika          250    27
16       17     deepak          290    24
17       18      mohit          395    16
18       19  abhisheek          288    24
19       20    navdeep          435     9

In [94]:
query = "SELECT roll_no,name FROM student_data"  
data = pd.read_sql_query(query, db)
display(data)

    roll_no       name
0        21      rohit
1         2      sunny
2         3     aakash
3         4      akash
4         5      sahil
5         6      vipul
6         7     nikhil
7         8   abhishek
8         9       ekta
9        10     sachin
10       11     simran
11       12      nancy
12       13     ayushi
13       14      mohit
14       17     deepak
15       18      mohit
16       19  abhisheek
17       20    navdeep
18       25    sachinn
19       26    sachinn

# select

In [11]:
cursor.execute("SELECT * FROM student_data1")

In [12]:
# fetch all
cursor.fetchall()

[(21, 'rohit', 400, 15),
 (2, 'ajay', 350, 20),
 (3, 'aakash', 420, 12),
 (4, 'akash', 410, 13),
 (5, 'sahil', 440, 8),
 (6, 'vipul', 340, 21),
 (7, 'nikhil', 400, 15),
 (8, 'abhishek', 450, 7),
 (9, 'ekta', 408, 14),
 (10, 'sachin', 460, 5),
 (11, 'simran', 330, 22),
 (12, 'nancy', 400, 15),
 (13, 'ayushi', 330, 22),
 (14, 'mohit', 480, 2),
 (15, 'rahul', 485, 1),
 (16, 'deepika', 250, 27),
 (17, 'deepak', 290, 24),
 (18, 'mohit', 395, 16),
 (19, 'abhisheek', 288, 24),
 (20, 'navdeep', 435, 9)]

In [13]:
x=cursor.execute("SELECT roll_no from student_data1")
for y in x:
    print(y)

(2,)
(3,)
(4,)
(5,)
(6,)
(7,)
(8,)
(9,)
(10,)
(11,)
(12,)
(13,)
(14,)
(15,)
(16,)
(17,)
(18,)
(19,)
(20,)
(21,)

In [14]:
cursor.execute("SELECT roll_no from student_data1")
roll_no=cursor.fetchall()
print(roll_no)

[(2,), (3,), (4,), (5,), (6,), (7,), (8,), (9,), (10,), (11,), (12,), (13,), (14,), (15,), (16,), (17,), (18,), (19,), (20,), (21,)]

In [15]:
# fetch all names
names=cursor.execute("SELECT name from student_data1")
for x in names:
    print(x)

('rohit',)
('ajay',)
('aakash',)
('akash',)
('sahil',)
('vipul',)
('nikhil',)
('abhishek',)
('ekta',)
('sachin',)
('simran',)
('nancy',)
('ayushi',)
('mohit',)
('rahul',)
('deepika',)
('deepak',)
('mohit',)
('abhisheek',)
('navdeep',)

In [25]:
cursor.execute("SELECT name from student_data1")
names=cursor.fetchall()[:10]
print(names)

[('rohit',), ('ajay',), ('aakash',), ('akash',), ('sahil',), ('vipul',), ('nikhil',), ('abhishek',), ('ekta',), ('sachin',)]

# show all tables

In [24]:
cursor.execute("SELECT name FROM sqlite_master WHERE type='table'")
tables = cursor.fetchall()
tables

[('student_data1',)]

# show column present in tables

In [28]:

cursor.execute("PRAGMA table_info(student_data1);")
cursor.fetchall()

[(0, 'roll_no', 'INT', 0, None, 1),
 (1, 'name', 'TEXT', 0, None, 0),
 (2, 'total_marks', 'INT', 0, None, 0),
 (3, 'rank', 'INT', 0, None, 0)]

cid: 0 → This is the first column in the table.
name: 'roll_no' → The column is named roll_no.
type: 'INT' → The data type of this column is INT (integer).
notnull: 0 → This column does not have a NOT NULL constraint.
dflt_value: None → There is no default value defined for this column.
pk: 1 → This column is the primary key of the table.

In [32]:
cursor.execute("PRAGMA table_info(student_data1)")
y=cursor.fetchall()
for column in y:
    print(column[1])

roll_no
name
total_marks
rank

# display specific columns

In [33]:
cursor.execute("SELECT name,rank from student_data1")
cursor.fetchall()

[('rohit', 15),
 ('ajay', 20),
 ('aakash', 12),
 ('akash', 13),
 ('sahil', 8),
 ('vipul', 21),
 ('nikhil', 15),
 ('abhishek', 7),
 ('ekta', 14),
 ('sachin', 5),
 ('simran', 22),
 ('nancy', 15),
 ('ayushi', 22),
 ('mohit', 2),
 ('rahul', 1),
 ('deepika', 27),
 ('deepak', 24),
 ('mohit', 16),
 ('abhisheek', 24),
 ('navdeep', 9)]

In [35]:
cursor.execute("SELECT name,rank from student_data1")
x=cursor.fetchall()
for names in x[:5]:
    print(names)

('rohit', 15)
('ajay', 20)
('aakash', 12)
('akash', 13)
('sahil', 8)

In [37]:
cursor.execute("SELECT name,rank from student_data1")
x=cursor.fetchall()
for names in x:
    print(f"name: {names[0]},    rank: {names[1]}")

name: rohit,    rank: 15
name: ajay,    rank: 20
name: aakash,    rank: 12
name: akash,    rank: 13
name: sahil,    rank: 8
name: vipul,    rank: 21
name: nikhil,    rank: 15
name: abhishek,    rank: 7
name: ekta,    rank: 14
name: sachin,    rank: 5
name: simran,    rank: 22
name: nancy,    rank: 15
name: ayushi,    rank: 22
name: mohit,    rank: 2
name: rahul,    rank: 1
name: deepika,    rank: 27
name: deepak,    rank: 24
name: mohit,    rank: 16
name: abhisheek,    rank: 24
name: navdeep,    rank: 9

# sorting the data

In [39]:
cursor.execute("SELECT * from student_data1 ORDER BY rank ASC")
cursor.fetchall()[:5]

[(15, 'rahul', 485, 1),
 (14, 'mohit', 480, 2),
 (10, 'sachin', 460, 5),
 (8, 'abhishek', 450, 7),
 (5, 'sahil', 440, 8)]

In [40]:
cursor.execute("SELECT * from student_data1 ORDER BY rank DESC")
cursor.fetchall()

[(16, 'deepika', 250, 27),
 (17, 'deepak', 290, 24),
 (19, 'abhisheek', 288, 24),
 (11, 'simran', 330, 22),
 (13, 'ayushi', 330, 22),
 (6, 'vipul', 340, 21),
 (2, 'ajay', 350, 20),
 (18, 'mohit', 395, 16),
 (21, 'rohit', 400, 15),
 (7, 'nikhil', 400, 15),
 (12, 'nancy', 400, 15),
 (9, 'ekta', 408, 14),
 (4, 'akash', 410, 13),
 (3, 'aakash', 420, 12),
 (20, 'navdeep', 435, 9),
 (5, 'sahil', 440, 8),
 (8, 'abhishek', 450, 7),
 (10, 'sachin', 460, 5),
 (14, 'mohit', 480, 2),
 (15, 'rahul', 485, 1)]

In [45]:
cursor.execute("SELECT name,total_marks from student_data1 ORDER BY name ASC")
cursor.fetchall()

[('aakash', 420),
 ('abhisheek', 288),
 ('abhishek', 450),
 ('ajay', 350),
 ('akash', 410),
 ('ayushi', 330),
 ('deepak', 290),
 ('deepika', 250),
 ('ekta', 408),
 ('mohit', 480),
 ('mohit', 395),
 ('nancy', 400),
 ('navdeep', 435),
 ('nikhil', 400),
 ('rahul', 485),
 ('rohit', 400),
 ('sachin', 460),
 ('sahil', 440),
 ('simran', 330),
 ('vipul', 340)]

# where method

In [21]:
cursor.execute("SELECT * from student_data where name='rahul'")
cursor.fetchall()

[(15, 'rahul', 485, 1)]

In [23]:
cursor.execute("SELECT name,rank from student_data where name='rahul'")
cursor.fetchall()

[('rahul', 1)]

........

In [26]:
cursor.execute("SELECT name,rank from student_data where rank Between 1 and 5")
cursor.fetchall()

[('sachin', 5), ('mohit', 2), ('rahul', 1)]

In [32]:
cursor.execute("SELECT * from student_data where rank >10")
cursor.fetchall()

[(21, 'rohit', 400, 15),
 (2, 'ajay', 350, 20),
 (3, 'aakash', 420, 12),
 (4, 'akash', 410, 13),
 (6, 'vipul', 340, 21),
 (7, 'nikhil', 400, 15),
 (9, 'ekta', 408, 14),
 (11, 'simran', 330, 22),
 (12, 'nancy', 400, 15),
 (13, 'ayushi', 330, 22),
 (16, 'deepika', 250, 27),
 (17, 'deepak', 290, 24),
 (18, 'mohit', 395, 16),
 (19, 'abhisheek', 288, 24)]

In [33]:
cursor.execute("SELECT * from student_data where rank >5 and rank<15")
cursor.fetchall()

[(3, 'aakash', 420, 12),
 (4, 'akash', 410, 13),
 (5, 'sahil', 440, 8),
 (8, 'abhishek', 450, 7),
 (9, 'ekta', 408, 14),
 (20, 'navdeep', 435, 9)]

............

In [35]:
cursor.execute("SELECT * from student_data where name IN ('sahil','rahul','ajay')")
cursor.fetchall()

[(2, 'ajay', 350, 20), (5, 'sahil', 440, 8), (15, 'rahul', 485, 1)]

In [37]:
cursor.execute("SELECT * FROM student_data WHERE name NOT IN ('rahul', 'ajay')")
cursor.fetchall()

[(21, 'rohit', 400, 15),
 (3, 'aakash', 420, 12),
 (4, 'akash', 410, 13),
 (5, 'sahil', 440, 8),
 (6, 'vipul', 340, 21),
 (7, 'nikhil', 400, 15),
 (8, 'abhishek', 450, 7),
 (9, 'ekta', 408, 14),
 (10, 'sachin', 460, 5),
 (11, 'simran', 330, 22),
 (12, 'nancy', 400, 15),
 (13, 'ayushi', 330, 22),
 (14, 'mohit', 480, 2),
 (16, 'deepika', 250, 27),
 (17, 'deepak', 290, 24),
 (18, 'mohit', 395, 16),
 (19, 'abhisheek', 288, 24),
 (20, 'navdeep', 435, 9)]

.................

In [ ]:
# like operator 

#  % - you can select the record that start ,including or end with a given letter or phrase.. use % to represent wildcard

In [38]:
x=cursor.execute("SELECT * from student_data where name LIKE '%h%'")
for a in x:
    print(a)

(21, 'rohit', 400, 15)
(3, 'aakash', 420, 12)
(4, 'akash', 410, 13)
(5, 'sahil', 440, 8)
(7, 'nikhil', 400, 15)
(8, 'abhishek', 450, 7)
(10, 'sachin', 460, 5)
(13, 'ayushi', 330, 22)
(14, 'mohit', 480, 2)
(15, 'rahul', 485, 1)
(18, 'mohit', 395, 16)
(19, 'abhisheek', 288, 24)

In [39]:
# name starting with 's'
x=cursor.execute("SELECT * from student_data where name LIKE 's%'")
for a in x:
    print(a)

(5, 'sahil', 440, 8)
(10, 'sachin', 460, 5)
(11, 'simran', 330, 22)

In [40]:
# name starting with 's' and ending with 'l'
x=cursor.execute("SELECT * from student_data where name LIKE 's%l'")
for a in x:
    print(a)

(5, 'sahil', 440, 8)

In [41]:
# find data where name 2nd alphabet is 'a' and have 1 aplhabet before it 
x=cursor.execute("SELECT * from student_data where name LIKE '_a%'")
for a in x:
    print(a)

(3, 'aakash', 420, 12)
(5, 'sahil', 440, 8)
(10, 'sachin', 460, 5)
(12, 'nancy', 400, 15)
(15, 'rahul', 485, 1)
(20, 'navdeep', 435, 9)

In [42]:
x=cursor.execute("SELECT * from student_data where name LIKE '__a%'")
for a in x:
    print(a)

(2, 'ajay', 350, 20)
(4, 'akash', 410, 13)

In [ ]:
x=cur.execute("SELECT * from student_data1 where name LIKE '__n%'")
for a in x:
    print(a)

In [43]:
x=cursor.execute("SELECT * from student_data where name LIKE '__n_'")
for a in x:
    print(a)

In [47]:
cursor.execute("SELECT * FROM student_data where total_marks > 400 OR rank < 10")
cursor.fetchall()

[(3, 'aakash', 420, 12),
 (4, 'akash', 410, 13),
 (5, 'sahil', 440, 8),
 (8, 'abhishek', 450, 7),
 (9, 'ekta', 408, 14),
 (10, 'sachin', 460, 5),
 (14, 'mohit', 480, 2),
 (15, 'rahul', 485, 1),
 (20, 'navdeep', 435, 9)]

In [48]:
cursor.execute("SELECT * FROM student_data WHERE total_marks > 400 AND rank < 10")
cursor.fetchall()

[(5, 'sahil', 440, 8),
 (8, 'abhishek', 450, 7),
 (10, 'sachin', 460, 5),
 (14, 'mohit', 480, 2),
 (15, 'rahul', 485, 1),
 (20, 'navdeep', 435, 9)]

In [50]:
# check null values
cursor.execute("SELECT * FROM student_data WHERE rank IS NULL")
cursor.fetchall()

[]

In [51]:

cursor.execute("SELECT * FROM student_data WHERE rank IS NOT NULL;")
cursor.fetchall()

[(21, 'rohit', 400, 15),
 (2, 'ajay', 350, 20),
 (3, 'aakash', 420, 12),
 (4, 'akash', 410, 13),
 (5, 'sahil', 440, 8),
 (6, 'vipul', 340, 21),
 (7, 'nikhil', 400, 15),
 (8, 'abhishek', 450, 7),
 (9, 'ekta', 408, 14),
 (10, 'sachin', 460, 5),
 (11, 'simran', 330, 22),
 (12, 'nancy', 400, 15),
 (13, 'ayushi', 330, 22),
 (14, 'mohit', 480, 2),
 (15, 'rahul', 485, 1),
 (16, 'deepika', 250, 27),
 (17, 'deepak', 290, 24),
 (18, 'mohit', 395, 16),
 (19, 'abhisheek', 288, 24),
 (20, 'navdeep', 435, 9)]

## subqueries

In [53]:
cursor.execute("SELECT * FROM student_data WHERE rank = (SELECT MIN(rank) FROM student_data)")
cursor.fetchall()

[(15, 'rahul', 485, 1)]

In [ ]:
cur.execute("SELECT * FROM student_data1 WHERE rank = (SELECT MAX(rank) FROM student_data1)")
cur.fetchall()

In [ ]:
cur.execute("SELECT * FROM student_data1 WHERE total_marks = (SELECT MIN(total_marks) FROM student_data1)")
cur.fetchall()

In [55]:
cursor.execute("SELECT MAX(rank) FROM student_data")
cursor.fetchall()

[(27,)]

# Update Data

In [56]:
# change sahil rank to 10
cursor.execute("UPDATE student_data SET rank=10 where name='sahil'")
db.commit()

In [58]:
cursor.execute("SELECT * from student_data")
cursor.fetchall()

[(21, 'rohit', 400, 15),
 (2, 'ajay', 350, 20),
 (3, 'aakash', 420, 12),
 (4, 'akash', 410, 13),
 (5, 'sahil', 440, 10),
 (6, 'vipul', 340, 21),
 (7, 'nikhil', 400, 15),
 (8, 'abhishek', 450, 7),
 (9, 'ekta', 408, 14),
 (10, 'sachin', 460, 5),
 (11, 'simran', 330, 22),
 (12, 'nancy', 400, 15),
 (13, 'ayushi', 330, 22),
 (14, 'mohit', 480, 2),
 (15, 'rahul', 485, 1),
 (16, 'deepika', 250, 27),
 (17, 'deepak', 290, 24),
 (18, 'mohit', 395, 16),
 (19, 'abhisheek', 288, 24),
 (20, 'navdeep', 435, 9)]

In [59]:
# change name from 'sac' to sunny
cursor.execute("UPDATE student_data SET name='sunny' where name='ajay'")
cursor.execute("SELECT name from student_data")
cursor.fetchall()

[('rohit',),
 ('sunny',),
 ('aakash',),
 ('akash',),
 ('sahil',),
 ('vipul',),
 ('nikhil',),
 ('abhishek',),
 ('ekta',),
 ('sachin',),
 ('simran',),
 ('nancy',),
 ('ayushi',),
 ('mohit',),
 ('rahul',),
 ('deepika',),
 ('deepak',),
 ('mohit',),
 ('abhisheek',),
 ('navdeep',)]

# order by method

In [60]:
cursor.execute("SELECT * FROM student_data ORDER BY name")
cursor.fetchall()

[(3, 'aakash', 420, 12),
 (19, 'abhisheek', 288, 24),
 (8, 'abhishek', 450, 7),
 (4, 'akash', 410, 13),
 (13, 'ayushi', 330, 22),
 (17, 'deepak', 290, 24),
 (16, 'deepika', 250, 27),
 (9, 'ekta', 408, 14),
 (14, 'mohit', 480, 2),
 (18, 'mohit', 395, 16),
 (12, 'nancy', 400, 15),
 (20, 'navdeep', 435, 9),
 (7, 'nikhil', 400, 15),
 (15, 'rahul', 485, 1),
 (21, 'rohit', 400, 15),
 (10, 'sachin', 460, 5),
 (5, 'sahil', 440, 10),
 (11, 'simran', 330, 22),
 (2, 'sunny', 350, 20),
 (6, 'vipul', 340, 21)]

In [61]:
cursor.execute("select * FROM student_data ORDER BY roll_no desc")
cursor.fetchall()

[(21, 'rohit', 400, 15),
 (20, 'navdeep', 435, 9),
 (19, 'abhisheek', 288, 24),
 (18, 'mohit', 395, 16),
 (17, 'deepak', 290, 24),
 (16, 'deepika', 250, 27),
 (15, 'rahul', 485, 1),
 (14, 'mohit', 480, 2),
 (13, 'ayushi', 330, 22),
 (12, 'nancy', 400, 15),
 (11, 'simran', 330, 22),
 (10, 'sachin', 460, 5),
 (9, 'ekta', 408, 14),
 (8, 'abhishek', 450, 7),
 (7, 'nikhil', 400, 15),
 (6, 'vipul', 340, 21),
 (5, 'sahil', 440, 10),
 (4, 'akash', 410, 13),
 (3, 'aakash', 420, 12),
 (2, 'sunny', 350, 20)]

# delete data

In [62]:
cursor.execute("DELETE FROM student_data WHERE roll_no=16")
db.commit()

In [63]:
cursor.rowcount

1

In [65]:
cursor.execute("SELECT * FROM student_data")
cursor.fetchall()

[(21, 'rohit', 400, 15),
 (2, 'sunny', 350, 20),
 (3, 'aakash', 420, 12),
 (4, 'akash', 410, 13),
 (5, 'sahil', 440, 10),
 (6, 'vipul', 340, 21),
 (7, 'nikhil', 400, 15),
 (8, 'abhishek', 450, 7),
 (9, 'ekta', 408, 14),
 (10, 'sachin', 460, 5),
 (11, 'simran', 330, 22),
 (12, 'nancy', 400, 15),
 (13, 'ayushi', 330, 22),
 (14, 'mohit', 480, 2),
 (15, 'rahul', 485, 1),
 (17, 'deepak', 290, 24),
 (18, 'mohit', 395, 16),
 (19, 'abhisheek', 288, 24),
 (20, 'navdeep', 435, 9)]

In [66]:
cursor.execute("DELETE FROM student_data WHERE total_marks>480 ")
cursor.execute("SELECT * FROM student_data")
cursor.fetchall()

[(21, 'rohit', 400, 15),
 (2, 'sunny', 350, 20),
 (3, 'aakash', 420, 12),
 (4, 'akash', 410, 13),
 (5, 'sahil', 440, 10),
 (6, 'vipul', 340, 21),
 (7, 'nikhil', 400, 15),
 (8, 'abhishek', 450, 7),
 (9, 'ekta', 408, 14),
 (10, 'sachin', 460, 5),
 (11, 'simran', 330, 22),
 (12, 'nancy', 400, 15),
 (13, 'ayushi', 330, 22),
 (14, 'mohit', 480, 2),
 (17, 'deepak', 290, 24),
 (18, 'mohit', 395, 16),
 (19, 'abhisheek', 288, 24),
 (20, 'navdeep', 435, 9)]

# Add a New Column to the Table

In [18]:
cursor.execute("ALTER TABLE student_data1 ADD COLUMN class_section TEXT")

In [19]:
# 1) Update a Specific Row: To update the class_section for a specific row:

cursor.execute("UPDATE student_data1 SET class_section = 'A' WHERE roll_no = 1")

In [20]:
# 2) update multiple rows

In [21]:
cursor.execute("UPDATE student_data1 SET class_section =CASE WHEN roll_no = 1 THEN 'A' WHEN roll_no = 2 THEN 'B' WHEN roll_no = 3 THEN 'C' END WHERE roll_no IN (1, 2, 3)")

In [70]:
cursor.execute("SELECT * FROM student_data")
cursor.fetchall()

[(21, 'rohit', 400, 15, None),
 (2, 'sunny', 350, 20, 'B'),
 (3, 'aakash', 420, 12, 'C'),
 (4, 'akash', 410, 13, None),
 (5, 'sahil', 440, 10, None),
 (6, 'vipul', 340, 21, None),
 (7, 'nikhil', 400, 15, None),
 (8, 'abhishek', 450, 7, None),
 (9, 'ekta', 408, 14, None),
 (10, 'sachin', 460, 5, None),
 (11, 'simran', 330, 22, None),
 (12, 'nancy', 400, 15, None),
 (13, 'ayushi', 330, 22, None),
 (14, 'mohit', 480, 2, None),
 (17, 'deepak', 290, 24, None),
 (18, 'mohit', 395, 16, None),
 (19, 'abhisheek', 288, 24, None),
 (20, 'navdeep', 435, 9, None)]

In [22]:
# 3) update all rows with same values
cursor.execute("UPDATE student_data1 SET class_section = 'A'")

In [23]:
cursor.execute("SELECT * FROM student_data1")
cursor.fetchall()

[(21, 'rohit', 400, 15, 'A'),
 (2, 'ajay', 350, 20, 'A'),
 (3, 'aakash', 420, 12, 'A'),
 (4, 'akash', 410, 13, 'A'),
 (5, 'sahil', 440, 8, 'A'),
 (6, 'vipul', 340, 21, 'A'),
 (7, 'nikhil', 400, 15, 'A'),
 (8, 'abhishek', 450, 7, 'A'),
 (9, 'ekta', 408, 14, 'A'),
 (10, 'sachin', 460, 5, 'A'),
 (11, 'simran', 330, 22, 'A'),
 (12, 'nancy', 400, 15, 'A'),
 (13, 'ayushi', 330, 22, 'A'),
 (14, 'mohit', 480, 2, 'A'),
 (15, 'rahul', 485, 1, 'A'),
 (16, 'deepika', 250, 27, 'A'),
 (17, 'deepak', 290, 24, 'A'),
 (18, 'mohit', 395, 16, 'A'),
 (19, 'abhisheek', 288, 24, 'A'),
 (20, 'navdeep', 435, 9, 'A')]

In [24]:
# 4)condition based updating

cursor.execute("UPDATE student_data1 SET class_section = 'B' WHERE total_marks > 400")
cursor.execute("SELECT * FROM student_data1")
cursor.fetchall()

[(21, 'rohit', 400, 15, 'A'),
 (2, 'ajay', 350, 20, 'A'),
 (3, 'aakash', 420, 12, 'B'),
 (4, 'akash', 410, 13, 'B'),
 (5, 'sahil', 440, 8, 'B'),
 (6, 'vipul', 340, 21, 'A'),
 (7, 'nikhil', 400, 15, 'A'),
 (8, 'abhishek', 450, 7, 'B'),
 (9, 'ekta', 408, 14, 'B'),
 (10, 'sachin', 460, 5, 'B'),
 (11, 'simran', 330, 22, 'A'),
 (12, 'nancy', 400, 15, 'A'),
 (13, 'ayushi', 330, 22, 'A'),
 (14, 'mohit', 480, 2, 'B'),
 (15, 'rahul', 485, 1, 'B'),
 (16, 'deepika', 250, 27, 'A'),
 (17, 'deepak', 290, 24, 'A'),
 (18, 'mohit', 395, 16, 'A'),
 (19, 'abhisheek', 288, 24, 'A'),
 (20, 'navdeep', 435, 9, 'B')]

# insert more data

In [86]:
cursor.execute("INSERT INTO student_data(roll_no,name,total_marks,rank,class_section) values(26,'sachinn',490,2,'A')")

In [87]:
cursor.execute("SELECT * FROM student_data")
cursor.fetchall()

[(21, 'rohit', 400, 15, 'A'),
 (2, 'sunny', 350, 20, 'A'),
 (3, 'aakash', 420, 12, 'B'),
 (4, 'akash', 410, 13, 'B'),
 (5, 'sahil', 440, 10, 'B'),
 (6, 'vipul', 340, 21, 'A'),
 (7, 'nikhil', 400, 15, 'A'),
 (8, 'abhishek', 450, 7, 'B'),
 (9, 'ekta', 408, 14, 'B'),
 (10, 'sachin', 460, 5, 'B'),
 (11, 'simran', 330, 22, 'A'),
 (12, 'nancy', 400, 15, 'A'),
 (13, 'ayushi', 330, 22, 'A'),
 (14, 'mohit', 480, 2, 'B'),
 (17, 'deepak', 290, 24, 'A'),
 (18, 'mohit', 395, 16, 'A'),
 (19, 'abhisheek', 288, 24, 'A'),
 (20, 'navdeep', 435, 9, 'B'),
 (25, 'sachinn', 490, 2, None),
 (26, 'sachinn', 490, 2, 'A')]

# count total entries

In [88]:
cursor.execute("SELECT count(*) from student_data")

In [89]:
cursor.fetchall()

[(20,)]

# aggregate functions

1) COUNT
2) SUM
3) AVERAGE (AVG))
4) MAXIMUM (MAX())
5) MINIMUM (MIN())
6) VARIANCE
7) STANDARD DEVIATION (STDDEV)
8) MEDIAN

### count

In [15]:
cursor.execute("select count(*) from student_data1")  #  Total number of rows
cursor.execute("SELECT COUNT(name) FROM student_data1")  # Total number of non-NULL names
cursor.fetchall()

[(20,)]

In [14]:
cursor.execute("SELECT COUNT(DISTINCT rank) FROM student_data1")  # count of unique ranks
cursor.fetchall()

[(16,)]

### Sum

In [16]:
cursor.execute("SELECT SUM(total_marks) from student_data1")
cursor.fetchall()

[(7761,)]

In [25]:

cursor.execute("SELECT SUM(total_marks) from student_data1 WHERE class_section = 'A'")
cursor.fetchall()

[(3773,)]

### AVERAGE

In [26]:
cursor.execute("SELECT AVG(total_marks) from student_data1")
cursor.fetchall()

[(388.05,)]

In [27]:
cursor.execute("SELECT AVG(rank) from student_data1")
cursor.fetchall()

[(14.6,)]

In [28]:
cursor.execute("SELECT AVG(total_marks) from student_data1 WHERE class_section='A'")
cursor.fetchall()

[(343.0,)]

### maximum, minimum

In [29]:
cursor.execute("SELECT MAX(rank) from student_data1")
cursor.fetchall()

[(27,)]

In [30]:
cursor.execute("SELECT MIN(rank) from student_data1")
cursor.fetchall()

[(1,)]

In [32]:
cursor.execute("SELECT MAX(total_marks) from student_data1")
cursor.fetchall()

[(485,)]

### variance

In [43]:
cursor.execute("SELECT MEDIAN(total_marks) from student_data1")
cursor.fetchall()

OperationalError: no such function: MEDIAN

### standard deviation

In [42]:
cursor.execute("SELECT STDDEV_SAMP(total_marks) FROM student_data1")
result = cursor.fetchall()
stddev_value = result[0][0]  # Access the first tuple's first element
print("Standard Deviation:", stddev_value)

OperationalError: no such function: STDDEV_SAMP

# group by

### group by column name

In [46]:
# Group students by rank and count the number of students in each rank
cursor.execute("SELECT rank,COUNT(*)  from student_data1 GROUP BY rank")
cursor.fetchall()

[(1, 1),
 (2, 1),
 (5, 1),
 (7, 1),
 (8, 1),
 (9, 1),
 (12, 1),
 (13, 1),
 (14, 1),
 (15, 3),
 (16, 1),
 (20, 1),
 (21, 1),
 (22, 2),
 (24, 2),
 (27, 1)]

In [47]:
cursor.execute("SELECT class_section,COUNT(*) FROM student_data1 GROUP BY class_section")
cursor.fetchall()

[('A', 11), ('B', 9)]

In [50]:
cursor.execute("SELECT name,COUNT(*) FROM student_data1 GROUP BY rank")
cursor.fetchall()

[('rahul', 1),
 ('mohit', 1),
 ('sachin', 1),
 ('abhishek', 1),
 ('sahil', 1),
 ('navdeep', 1),
 ('aakash', 1),
 ('akash', 1),
 ('ekta', 1),
 ('rohit', 3),
 ('mohit', 1),
 ('ajay', 1),
 ('vipul', 1),
 ('simran', 2),
 ('deepak', 2),
 ('deepika', 1)]

### group by multiple columns

In [51]:
cursor.execute("SELECT class_section,rank,count(*) FROM student_data1 GROUP BY class_section,rank")
cursor.fetchall()

[('A', 15, 3),
 ('A', 16, 1),
 ('A', 20, 1),
 ('A', 21, 1),
 ('A', 22, 2),
 ('A', 24, 2),
 ('A', 27, 1),
 ('B', 1, 1),
 ('B', 2, 1),
 ('B', 5, 1),
 ('B', 7, 1),
 ('B', 8, 1),
 ('B', 9, 1),
 ('B', 12, 1),
 ('B', 13, 1),
 ('B', 14, 1)]

### using aggregate function in group by clause

In [52]:
cursor.execute("SELECT class_section, AVG(total_marks) as avg_marks FROM student_data1 GROUP BY class_section")
cursor.fetchall()

[('A', 343.0), ('B', 443.1111111111111)]

### group by with order by

In [55]:
cursor.execute("SELECT class_section,SUM(total_marks) AS total_marks FROM student_data1 GROUP BY class_section ORDER BY total_marks DESC")
cursor.fetchall()

[('B', 3988), ('A', 3773)]

### group by with subqueries

In [61]:
cursor.execute("SELECT class_section,MAX(total_marks) AS highest_marks FROM (SELECT * FROM student_data1 WHERE rank <= 10) AS top_Students GROUP BY class_section")
cursor.fetchall()

[('B', 485)]

In [62]:
cursor.execute("SELECT class_section,MAX(total_marks) AS highest_marks FROM (SELECT * FROM student_data1 WHERE rank <= 20) AS top_Students GROUP BY class_section")
cursor.fetchall()

[('A', 400), ('B', 485)]

In [60]:
cursor.execute("SELECT total_marks,rank,class_section from student_data1")
cursor.fetchall()

[(400, 15, 'A'),
 (350, 20, 'A'),
 (420, 12, 'B'),
 (410, 13, 'B'),
 (440, 8, 'B'),
 (340, 21, 'A'),
 (400, 15, 'A'),
 (450, 7, 'B'),
 (408, 14, 'B'),
 (460, 5, 'B'),
 (330, 22, 'A'),
 (400, 15, 'A'),
 (330, 22, 'A'),
 (480, 2, 'B'),
 (485, 1, 'B'),
 (250, 27, 'A'),
 (290, 24, 'A'),
 (395, 16, 'A'),
 (288, 24, 'A'),
 (435, 9, 'B')]

# Limit the Output

In [63]:
 # retrive top five
cursor.execute("SELECT * FROM student_data1 ORDER BY total_marks DESC LIMIT 5")
cursor.fetchall()

[(15, 'rahul', 485, 1, 'B'),
 (14, 'mohit', 480, 2, 'B'),
 (10, 'sachin', 460, 5, 'B'),
 (8, 'abhishek', 450, 7, 'B'),
 (5, 'sahil', 440, 8, 'B')]

In [64]:
cursor.execute("SELECT name,rank FROM student_data1 ORDER BY total_marks ASC LIMIT 5")
cursor.fetchall()

[('deepika', 27),
 ('abhisheek', 24),
 ('deepak', 24),
 ('simran', 22),
 ('ayushi', 22)]

# SQL joins

The SQL Joins clause is used to combine records from two or more tables in a database. A JOIN is a 
means for combining fields from two tables by using values common to each.

## SQL Join Types:
There are different types of joins available in SQL:

1 INNER JOIN: returns rows when there is a match in both tables.

2 LEFT JOIN: returns all rows from the left table, even if there are no matches in the right table.

3 RIGHT JOIN: returns all rows from the right table, even if there are no matches in the left table.

4 FULL JOIN: returns rows when there is a match in one of the tables.

5 SELF JOIN: is used to join a table to itself as if the table were two tables, temporarily renaming at least one 
table in the SQL statement.

In [56]:
# create batabase

In [57]:
import sqlite3

In [61]:
db2=sqlite3.connect("my_db1")

In [62]:
# cursor
cursor=db2.cursor()

In [63]:
#create table1
cursor.execute("CREATE TABLE student_data(roll_no INT PRIMARY KEY,name TEXT, total_marks INT,rank INT,class_section TEXT)")

In [64]:
# insert data into table 1
cursor.execute("INSERT INTO student_data(roll_no,name,total_marks,rank,class_section) values(1, 'Rohit', 400, 15, 'A'),(2, 'Ajay', 350, 20, 'B'),(3, 'Aakash', 420, 12, 'A'),(4, 'Akash', 410, 13, 'C'),(5, 'Sahil', 440, 8, 'B'),(6, 'Vipul', 340, 21, 'A'),(7, 'Nikhil', 400, 15, 'C')")

In [65]:
# create second table
cursor.execute("CREATE TABLE student_subjects(roll_no INT,subject_name TEXT)")

# insert data
cursor.execute("INSERT INTO student_subjects(roll_no,subject_name) values(1, 'Math'),(1, 'Science'),(2, 'History'),(3, 'Math'),(4, 'Science'),(5, 'History'),(7, 'Math')")

In [66]:
cursor.execute("SELECT * FROM student_data")
cursor.fetchall()

[(1, 'Rohit', 400, 15, 'A'),
 (2, 'Ajay', 350, 20, 'B'),
 (3, 'Aakash', 420, 12, 'A'),
 (4, 'Akash', 410, 13, 'C'),
 (5, 'Sahil', 440, 8, 'B'),
 (6, 'Vipul', 340, 21, 'A'),
 (7, 'Nikhil', 400, 15, 'C')]

In [67]:
cursor.execute("SELECT * FROM student_subjects")
cursor.fetchall()

[(1, 'Math'),
 (1, 'Science'),
 (2, 'History'),
 (3, 'Math'),
 (4, 'Science'),
 (5, 'History'),
 (7, 'Math')]

### inner join

In [68]:
cursor.execute("SELECT student_data.name,student_data.class_section,student_subjects.subject_name FROM student_data INNER JOIN student_subjects ON student_data.roll_no=student_subjects.roll_no")

In [69]:
cursor.fetchall()

[('Rohit', 'A', 'Math'),
 ('Rohit', 'A', 'Science'),
 ('Ajay', 'B', 'History'),
 ('Aakash', 'A', 'Math'),
 ('Akash', 'C', 'Science'),
 ('Sahil', 'B', 'History'),
 ('Nikhil', 'C', 'Math')]

### left join

In [70]:
cursor.execute("SELECT student_data.name, student_data.class_section, student_subjects.subject_name FROM student_data LEFT JOIN student_subjects ON student_data.roll_no = student_subjects.roll_no")
cursor.fetchall()

[('Rohit', 'A', 'Math'),
 ('Rohit', 'A', 'Science'),
 ('Ajay', 'B', 'History'),
 ('Aakash', 'A', 'Math'),
 ('Akash', 'C', 'Science'),
 ('Sahil', 'B', 'History'),
 ('Vipul', 'A', None),
 ('Nikhil', 'C', 'Math')]

### right join

In [72]:
cursor.execute("SELECT student_subjects.subject_name, student_data.name, student_data.class_section FROM student_subjects RIGHT JOIN student_data ON student_subjects.roll_no = student_data.roll_no")
cursor.fetchall()

[('Math', 'Rohit', 'A'),
 ('Science', 'Rohit', 'A'),
 ('History', 'Ajay', 'B'),
 ('Math', 'Aakash', 'A'),
 ('Science', 'Akash', 'C'),
 ('History', 'Sahil', 'B'),
 ('Math', 'Nikhil', 'C'),
 (None, 'Vipul', 'A')]

### full join

In [73]:
cursor.execute("SELECT student_data.name, student_data.class_section, student_subjects.subject_name FROM student_data LEFT JOIN student_subjects ON student_data.roll_no = student_subjects.roll_no UNION SELECT student_data.name, student_data.class_section, student_subjects.subject_name FROM student_subjects LEFT JOIN student_data ON student_subjects.roll_no = student_data.roll_no")

In [74]:
cursor.fetchall()

[('Aakash', 'A', 'Math'),
 ('Ajay', 'B', 'History'),
 ('Akash', 'C', 'Science'),
 ('Nikhil', 'C', 'Math'),
 ('Rohit', 'A', 'Math'),
 ('Rohit', 'A', 'Science'),
 ('Sahil', 'B', 'History'),
 ('Vipul', 'A', None)]

# view

In [75]:
cursor.execute("CREATE VIEW view_names AS SELECT * FROM student_data")

In [76]:
cursor.execute("SELECT * from view_names")
cursor.fetchall()

[(1, 'Rohit', 400, 15, 'A'),
 (2, 'Ajay', 350, 20, 'B'),
 (3, 'Aakash', 420, 12, 'A'),
 (4, 'Akash', 410, 13, 'C'),
 (5, 'Sahil', 440, 8, 'B'),
 (6, 'Vipul', 340, 21, 'A'),
 (7, 'Nikhil', 400, 15, 'C')]

# import data from csv to sql

In [77]:
import sqlite3
import pandas as pd
# create database
conn = sqlite3.connect('db5')
data = pd.read_csv(r'C:\Users\SACHIN\OneDrive\Documents\ML MODELS DATA\ds_salaries.csv')
data.to_sql('salary', conn, if_exists='replace', index=False)
# connect cursor
cursor = conn.cursor()

cursor.execute("SELECT * FROM salary")
rows = cursor.fetchall()[:10]
for row in rows:
    print(row)

(2023, 'SE', 'FT', 'Principal Data Scientist', 80000, 'EUR', 85847, 'ES', 100, 'ES', 'L')
(2023, 'MI', 'CT', 'ML Engineer', 30000, 'USD', 30000, 'US', 100, 'US', 'S')
(2023, 'MI', 'CT', 'ML Engineer', 25500, 'USD', 25500, 'US', 100, 'US', 'S')
(2023, 'SE', 'FT', 'Data Scientist', 175000, 'USD', 175000, 'CA', 100, 'CA', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 120000, 'USD', 120000, 'CA', 100, 'CA', 'M')
(2023, 'SE', 'FT', 'Applied Scientist', 222200, 'USD', 222200, 'US', 0, 'US', 'L')
(2023, 'SE', 'FT', 'Applied Scientist', 136000, 'USD', 136000, 'US', 0, 'US', 'L')
(2023, 'SE', 'FT', 'Data Scientist', 219000, 'USD', 219000, 'CA', 0, 'CA', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 141000, 'USD', 141000, 'CA', 0, 'CA', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 147100, 'USD', 147100, 'US', 0, 'US', 'M')

In [78]:
data.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M

In [83]:
cursor.execute("PRAGMA table_info(salary)")

In [84]:
y=cursor.fetchall()
for column in y:
    print(column[1])

work_year
experience_level
employment_type
job_title
salary
salary_currency
salary_in_usd
employee_residence
remote_ratio
company_location
company_size

In [48]:
query="SELECT * FROM salary"
data=pd.read_sql_query(query,conn)

In [49]:
data

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M
...,...,...,...,...,...,...,...,...,...,...,...
3750,2020,SE,FT,Data Scientist,412000,USD,412000,US,100,US,L
3751,2021,MI,FT,Principal Data Scientist,151000,USD,151000,US,100,US,L
3752,2020,EN,FT,Data Scientist,105000,USD,105000,US,100,US,S
3753,2020,EN,CT,Business Data Analyst,100000,USD,100000,US,100,US,L
3754,2021,SE,FT,Data Science Manager,7000000,INR,94665,IN,50,IN,L

In [51]:
cursor.execute("SELECT * FROM salary WHERE salary>100000")
x=cursor.fetchall()
for df in x:
    print(df)

(2023, 'SE', 'FT', 'Data Scientist', 175000, 'USD', 175000, 'CA', 100, 'CA', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 120000, 'USD', 120000, 'CA', 100, 'CA', 'M')
(2023, 'SE', 'FT', 'Applied Scientist', 222200, 'USD', 222200, 'US', 0, 'US', 'L')
(2023, 'SE', 'FT', 'Applied Scientist', 136000, 'USD', 136000, 'US', 0, 'US', 'L')
(2023, 'SE', 'FT', 'Data Scientist', 219000, 'USD', 219000, 'CA', 0, 'CA', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 141000, 'USD', 141000, 'CA', 0, 'CA', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 147100, 'USD', 147100, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Analyst', 130000, 'USD', 130000, 'US', 100, 'US', 'M')
(2023, 'EN', 'FT', 'Applied Scientist', 213660, 'USD', 213660, 'US', 0, 'US', 'L')
(2023, 'EN', 'FT', 'Applied Scientist', 130760, 'USD', 130760, 'US', 0, 'US', 'L')
(2023, 'SE', 'FT', 'Data Modeler', 147100, 'USD', 147100, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 170000, 'USD', 170000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 150000, 'USD', 150000, 'US', 0, 'US', 'M')
(2023, 'MI', 'FT', 'Data Analyst', 150000, 'USD', 150000, 'US', 100, 'US', 'M')
(2023, 'MI', 'FT', 'Data Analyst', 110000, 'USD', 110000, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Research Engineer', 275000, 'USD', 275000, 'DE', 0, 'DE', 'M')
(2023, 'SE', 'FT', 'Research Engineer', 174000, 'USD', 174000, 'DE', 0, 'DE', 'M')
(2023, 'SE', 'FT', 'Analytics Engineer', 230000, 'USD', 230000, 'GB', 100, 'GB', 'M')
(2023, 'SE', 'FT', 'Analytics Engineer', 143200, 'USD', 143200, 'GB', 100, 'GB', 'M')
(2023, 'SE', 'FT', 'Business Intelligence Engineer', 225000, 'USD', 225000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Business Intelligence Engineer', 156400, 'USD', 156400, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Machine Learning Engineer', 200000, 'USD', 200000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Machine Learning Engineer', 130000, 'USD', 130000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 253200, 'USD', 253200, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Computer Vision Engineer', 342810, 'USD', 342810, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Computer Vision Engineer', 184590, 'USD', 184590, 'US', 0, 'US', 'M')
(2023, 'MI', 'FT', 'Data Engineer', 162500, 'USD', 162500, 'US', 0, 'US', 'M')
(2023, 'MI', 'FT', 'Data Engineer', 130000, 'USD', 130000, 'US', 0, 'US', 'M')
(2023, 'MI', 'FT', 'Data Analyst', 105380, 'USD', 105380, 'US', 0, 'US', 'M')
(2022, 'MI', 'FT', 'Machine Learning Engineer', 1650000, 'INR', 20984, 'IN', 50, 'IN', 'L')
(2023, 'EN', 'FT', 'Applied Scientist', 204620, 'USD', 204620, 'US', 0, 'US', 'L')
(2023, 'EN', 'FT', 'Applied Scientist', 110680, 'USD', 110680, 'US', 0, 'US', 'L')
(2023, 'SE', 'FT', 'Data Engineer', 270703, 'USD', 270703, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 221484, 'USD', 221484, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 212750, 'USD', 212750, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 185000, 'USD', 185000, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 262000, 'USD', 262000, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 245000, 'USD', 245000, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 275300, 'USD', 275300, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 183500, 'USD', 183500, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 218500, 'USD', 218500, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 199098, 'USD', 199098, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 203300, 'USD', 203300, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 123600, 'USD', 123600, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Research Engineer', 189110, 'USD', 189110, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Research Engineer', 139000, 'USD', 139000, 'US', 0, 'US', 'M')
(2023, 'EX', 'FT', 'Data Scientist', 258750, 'USD', 258750, 'US', 0, 'US', 'M')
(2023, 'EX', 'FT', 'Data Scientist', 185000, 'USD', 185000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 231500, 'USD', 231500, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 166000, 'USD', 166000, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 172500, 'USD', 172500, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 110500, 'USD', 110500, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 238000, 'USD', 238000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 176000, 'USD', 176000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 237000, 'USD', 237000, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 201450, 'USD', 201450, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Applied Scientist', 309400, 'USD', 309400, 'US', 0, 'US', 'L')
(2023, 'SE', 'FT', 'Applied Scientist', 159100, 'USD', 159100, 'US', 0, 'US', 'L')
(2023, 'SE', 'FT', 'Data Engineer', 115000, 'USD', 115000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 237000, 'USD', 237000, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 201450, 'USD', 201450, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Computer Vision Engineer', 280000, 'USD', 280000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Computer Vision Engineer', 210000, 'USD', 210000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Architect', 280100, 'USD', 280100, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Architect', 168100, 'USD', 168100, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 193500, 'USD', 193500, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 139000, 'USD', 139000, 'US', 100, 'US', 'M')
(2023, 'MI', 'FT', 'Data Scientist', 510000, 'HKD', 65062, 'HK', 0, 'HK', 'L')
(2023, 'SE', 'FT', 'Machine Learning Engineer', 150000, 'USD', 150000, 'PT', 100, 'US', 'M')
(2022, 'EN', 'FT', 'AI Developer', 300000, 'USD', 300000, 'IN', 50, 'IN', 'L')
(2023, 'SE', 'FT', 'Business Intelligence Engineer', 185900, 'USD', 185900, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Business Intelligence Engineer', 129300, 'USD', 129300, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 225000, 'USD', 225000, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 175000, 'USD', 175000, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 185000, 'USD', 185000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 140000, 'USD', 140000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 105000, 'USD', 105000, 'US', 0, 'US', 'M')
(2023, 'EN', 'FT', 'Machine Learning Engineer', 163196, 'USD', 163196, 'US', 0, 'US', 'M')
(2023, 'EN', 'FT', 'Machine Learning Engineer', 145885, 'USD', 145885, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 217000, 'USD', 217000, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 185000, 'USD', 185000, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Analyst', 202800, 'USD', 202800, 'US', 0, 'US', 'L')
(2023, 'SE', 'FT', 'Data Analyst', 104300, 'USD', 104300, 'US', 0, 'US', 'L')
(2023, 'SE', 'FT', 'Data Analyst', 145000, 'USD', 145000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 165000, 'USD', 165000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 132300, 'USD', 132300, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 179170, 'USD', 179170, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Analytics Engineer', 152500, 'USD', 152500, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Analytics Engineer', 116450, 'USD', 116450, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 247300, 'USD', 247300, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 133800, 'USD', 133800, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Research Engineer', 203000, 'USD', 203000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Research Engineer', 133000, 'USD', 133000, 'US', 0, 'US', 'M')
(2023, 'EN', 'FT', 'Research Scientist', 220000, 'USD', 220000, 'US', 50, 'US', 'L')
(2023, 'SE', 'FT', 'Data Scientist', 150000, 'USD', 150000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 120000, 'USD', 120000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Analytics Engineer', 289800, 'USD', 289800, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Analytics Engineer', 214000, 'USD', 214000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Analytics Engineer', 179820, 'USD', 179820, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Analytics Engineer', 143860, 'USD', 143860, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Machine Learning Engineer', 283200, 'USD', 283200, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Machine Learning Engineer', 188800, 'USD', 188800, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Analytics Engineer', 289800, 'USD', 289800, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Analytics Engineer', 214200, 'USD', 214200, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 185900, 'USD', 185900, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 129300, 'USD', 129300, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 252000, 'USD', 252000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 129000, 'USD', 129000, 'US', 0, 'US', 'M')
(2023, 'MI', 'FT', 'Data Analytics Manager', 155000, 'USD', 155000, 'US', 0, 'US', 'M')
(2023, 'MI', 'FT', 'Data Analytics Manager', 140000, 'USD', 140000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 161800, 'USD', 161800, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 141600, 'USD', 141600, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Machine Learning Engineer', 342300, 'USD', 342300, 'US', 0, 'US', 'L')
(2023, 'SE', 'FT', 'Machine Learning Engineer', 176100, 'USD', 176100, 'US', 0, 'US', 'L')
(2023, 'SE', 'FT', 'Data Scientist', 138784, 'USD', 138784, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Analyst', 204500, 'USD', 204500, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Analyst', 138900, 'USD', 138900, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Machine Learning Engineer', 318300, 'USD', 318300, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Machine Learning Engineer', 212200, 'USD', 212200, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 195000, 'USD', 195000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 160000, 'USD', 160000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Analytics Engineer', 230000, 'USD', 230000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Analytics Engineer', 143200, 'USD', 143200, 'US', 0, 'US', 'M')
(2023, 'MI', 'FT', 'Business Data Analyst', 105000, 'USD', 105000, 'US', 50, 'US', 'L')
(2023, 'MI', 'FT', 'Applied Data Scientist', 1700000, 'INR', 20670, 'IN', 100, 'IN', 'L')
(2023, 'SE', 'FT', 'Data Engineer', 145000, 'USD', 145000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 115000, 'USD', 115000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Analyst', 168400, 'USD', 168400, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Analyst', 105200, 'USD', 105200, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Applied Scientist', 309400, 'USD', 309400, 'US', 0, 'US', 'L')
(2023, 'SE', 'FT', 'Applied Scientist', 159100, 'USD', 159100, 'US', 0, 'US', 'L')
(2023, 'SE', 'FT', 'Machine Learning Engineer', 190000, 'USD', 190000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Machine Learning Engineer', 150000, 'USD', 150000, 'US', 0, 'US', 'M')
(2023, 'MI', 'FT', 'Data Engineer', 162500, 'USD', 162500, 'US', 0, 'US', 'M')
(2023, 'MI', 'FT', 'Data Engineer', 130000, 'USD', 130000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Analytics Engineer', 150000, 'USD', 150000, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Analytics Engineer', 120000, 'USD', 120000, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 145000, 'USD', 145000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 120000, 'USD', 120000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Applied Scientist', 222200, 'USD', 222200, 'US', 0, 'US', 'L')
(2023, 'SE', 'FT', 'Applied Scientist', 136000, 'USD', 136000, 'US', 0, 'US', 'L')
(2023, 'SE', 'FT', 'Data Engineer', 241000, 'USD', 241000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 155000, 'USD', 155000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 220000, 'USD', 220000, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 190000, 'USD', 190000, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 160000, 'USD', 160000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 140000, 'USD', 140000, 'US', 0, 'US', 'M')
(2023, 'MI', 'FT', 'Machine Learning Engineer', 300000, 'USD', 300000, 'US', 0, 'US', 'M')
(2023, 'MI', 'FT', 'Machine Learning Engineer', 250000, 'USD', 250000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 228000, 'USD', 228000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 186000, 'USD', 186000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 190000, 'USD', 190000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 170000, 'USD', 170000, 'US', 0, 'US', 'M')
(2023, 'MI', 'FT', 'Research Engineer', 230000, 'USD', 230000, 'US', 0, 'US', 'M')
(2023, 'MI', 'FT', 'Research Engineer', 200000, 'USD', 200000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Architect', 180000, 'USD', 180000, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Architect', 115000, 'USD', 115000, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Architect', 200000, 'USD', 200000, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Architect', 115000, 'USD', 115000, 'US', 100, 'US', 'M')
(2023, 'EX', 'FT', 'Data Engineer', 220000, 'USD', 220000, 'US', 0, 'US', 'M')
(2023, 'EX', 'FT', 'Data Engineer', 205000, 'USD', 205000, 'US', 0, 'US', 'M')
(2023, 'MI', 'FT', 'Data Engineer', 180000, 'USD', 180000, 'US', 0, 'US', 'M')
(2023, 'MI', 'FT', 'Data Engineer', 130000, 'USD', 130000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 200000, 'USD', 200000, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 150000, 'USD', 150000, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Computer Vision Engineer', 215000, 'USD', 215000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Computer Vision Engineer', 170000, 'USD', 170000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Machine Learning Engineer', 247500, 'USD', 247500, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Machine Learning Engineer', 172200, 'USD', 172200, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 224000, 'USD', 224000, 'CA', 0, 'CA', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 176000, 'USD', 176000, 'CA', 0, 'CA', 'M')
(2023, 'SE', 'FT', 'Data Analyst', 120000, 'USD', 120000, 'US', 100, 'US', 'M')
(2023, 'EN', 'FT', 'Data Engineer', 1400000, 'INR', 17022, 'IN', 100, 'IN', 'L')
(2023, 'SE', 'FT', 'Data Analyst', 140000, 'USD', 140000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Analyst', 120000, 'USD', 120000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 128000, 'USD', 128000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 145000, 'USD', 145000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 115000, 'USD', 115000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 185000, 'USD', 185000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 140000, 'USD', 140000, 'US', 0, 'US', 'M')
(2023, 'EX', 'FT', 'Head of Data', 329500, 'USD', 329500, 'US', 0, 'US', 'M')
(2023, 'EX', 'FT', 'Head of Data', 269600, 'USD', 269600, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 250000, 'USD', 250000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 162500, 'USD', 162500, 'US', 0, 'US', 'M')
(2023, 'MI', 'FT', 'AI Developer', 200000, 'USD', 200000, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 145000, 'USD', 145000, 'US', 0, 'US', 'M')
(2023, 'EX', 'FT', 'Data Engineer', 145000, 'USD', 145000, 'US', 0, 'US', 'M')
(2023, 'EX', 'FT', 'Data Engineer', 115000, 'USD', 115000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 203500, 'USD', 203500, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 152000, 'USD', 152000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 239000, 'USD', 239000, 'US', 0, 'US', 'L')
(2023, 'SE', 'FT', 'Data Scientist', 122900, 'USD', 122900, 'US', 0, 'US', 'L')
(2023, 'SE', 'FT', 'Data Scientist', 237000, 'USD', 237000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 145000, 'USD', 145000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Science Manager', 191765, 'USD', 191765, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Science Manager', 134236, 'USD', 134236, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Analytics Engineer', 190000, 'USD', 190000, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Analytics Engineer', 112000, 'USD', 112000, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Analyst', 135000, 'USD', 135000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Analyst', 105500, 'USD', 105500, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Research Engineer', 293000, 'USD', 293000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Research Engineer', 185000, 'USD', 185000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 220000, 'USD', 220000, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 160000, 'USD', 160000, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 175000, 'USD', 175000, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 145000, 'USD', 145000, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Analyst', 200000, 'USD', 200000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Analyst', 148500, 'USD', 148500, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 240500, 'USD', 240500, 'US', 0, 'US', 'L')
(2023, 'SE', 'FT', 'Data Engineer', 123700, 'USD', 123700, 'US', 0, 'US', 'L')
(2023, 'SE', 'FT', 'Analytics Engineer', 152900, 'USD', 152900, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Analytics Engineer', 117100, 'USD', 117100, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Analytics Engineer', 173000, 'USD', 173000, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Analytics Engineer', 113000, 'USD', 113000, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Applied Scientist', 260000, 'USD', 260000, 'US', 0, 'US', 'L')
(2023, 'SE', 'FT', 'Applied Scientist', 136000, 'USD', 136000, 'US', 0, 'US', 'L')
(2023, 'EX', 'FT', 'Data Engineer', 175000, 'USD', 175000, 'US', 0, 'US', 'M')
(2023, 'EX', 'FT', 'Data Engineer', 110000, 'USD', 110000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Applied Scientist', 260000, 'USD', 260000, 'US', 0, 'US', 'L')
(2023, 'SE', 'FT', 'Applied Scientist', 136000, 'USD', 136000, 'US', 0, 'US', 'L')
(2023, 'SE', 'FT', 'Research Scientist', 130000, 'USD', 130000, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Research Scientist', 110000, 'USD', 110000, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Applied Scientist', 205000, 'USD', 205000, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Applied Scientist', 184000, 'USD', 184000, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Analyst', 149500, 'USD', 149500, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Analyst', 127075, 'USD', 127075, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 195000, 'USD', 195000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 160000, 'USD', 160000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 219535, 'USD', 219535, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Engineer', 146115, 'USD', 146115, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 170000, 'USD', 170000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 135000, 'USD', 135000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 175000, 'USD', 175000, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 145000, 'USD', 145000, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 199000, 'USD', 199000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Scientist', 162000, 'USD', 162000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Applied Scientist', 222200, 'USD', 222200, 'US', 0, 'US', 'L')
(2023, 'SE', 'FT', 'Applied Scientist', 136000, 'USD', 136000, 'US', 0, 'US', 'L')
(2023, 'EX', 'FT', 'Analytics Engineer', 221000, 'USD', 221000, 'US', 100, 'US', 'M')
(2023, 'EX', 'FT', 'Analytics Engineer', 153000, 'USD', 153000, 'US', 100, 'US', 'M')
(2023, 'SE', 'FT', 'Data Analyst', 187000, 'USD', 187000, 'US', 0, 'US', 'M')
(2023, 'SE', 'FT', 'Data Analyst', 128000, 'USD', 128000, 'US', 0, 'US', 'M')

In [55]:
cursor.execute("SELECT experience_level,COUNT(*) FROM salary GROUP BY experience_level")
x=cursor.fetchall()
for df in x:
    print(df)

('EN', 320)
('EX', 114)
('MI', 805)
('SE', 2516)